

def flowerLanguage(flower):
    if(flower == "무궁화"):
        print("꽃말 : 끈기, 섬세한 아름다움 ")
        print("설명 : 무궁화는 낙엽 관목으로서 여러 품종이 있고 높이가 3-4m에 달하며, 어린 가지에 털이 많으나 점차 없어진다. 무궁화는 정원에서 재배가 쉽고 씨로 번식이 가능하지만 꺽꽂이로 번식되므로 형질을 변형시키지 않고 유지하는 것이 쉽다. 잎은 어긋나며 달걀모양이고 대개 3개로 갈라지고 가장자리에는 톱니가 있다. \n")
        print("개화시기 : 7 ~ 10월\n")
    if(flower == "백합"):
        print("순결, 변함 없는 사랑")
        print("높이 2m까지 자라는 구근(球根) 식물로 구근은 인경(鱗莖)으로 둥글다."
             ," 인경은 희거나 연노란색이고 직경은 10cm 내외다. 잎의 길이는 10~18cm이며 피침형으로 표면은 광택이 나고 엽병(葉柄)은 없다. 꽃의 길이는 15~18cm로 5~7월에 순백색 또는 황록색을 띠며 옆으로 향해 핀다\n")
    if(flower == "철쭉"):
        print("꽃말 : 사랑의 즐거움 ")
        print("줄기는 높이 2-5m이다. 잎은 가지 끝에 4-5장씩 어긋나게 모여 나며 잎자루는 짧다. 잎몸은 도란형 또는 넓은 난형으로 길이 5-7cm, 폭 3-5cm이며 가장자리가 밋밋하다. 꽃은 잎과 동시에 피며 가지 끝에 3-7개씩 산형으로 달리고 연분홍색 또는 드물게 흰색이다. 꽃자루는 길이 1-1.5cm이다. 화관은 깔때기 모양이며 윗부분 안쪽에 붉은 갈색 반점이 있고 지름 5-6cm이다. 수술은 10개이고, 그 중에 5개가 길다. 암술은 1개이다. 열매는 삭과, 난형이다.\n")
    if(flower == "진달래"):
        print("꽃말 : 사랑의 즐거움 ")
        print("진달래는 우리나라 각처에서 자라는 식물로, 잎보다 꽃이 먼저 핀다. 꽃의 색은 분홍색·진분홍색·흰색·자주분홍색 등으로 다양하다. 꽃잎으로는 화전(花煎)이나 진달래술을 만들어 먹고, 조경(調經)·활혈(活血)·진해(鎭咳)의 효능이 있다고 하여 약재로도 이용되었다.\n")
    if(flower == "벚꽃"):
        print("꽃말 : 순결, 절세미인 ")
        print("벚꽃은 벚나무에서 피는 꽃이다. 봄에 화창하게 피는 분홍색, 또는 하얀색 꽃잎이 유명하다. 꽃말은 대표적으로 중간고사, 아름다운 정신(영혼), 정신적 사랑, 삶의 아름다움이다.\n벚꽃은 벚나무속(Prunus) 벚나무아속(subg. Japanese cherry) 벚나무절(sect. Cerasus) 식물의 꽃이다. 특히 동아시아의 벚나무 종의 나무에서 피는 꽃을 말한다. 히말라야 지역이 원산이라는 이야기도 있으며, 현재는 일본, 한국, 네팔, 대만, 이란, 미국 등 북반구의 온대지역 전역에서 핀다.\n")
    if(flower == "연꽃"):
        print("꽃말 : 배신, 청결, 신성 ")
        print("아시아 남부와 오스트레일리아 북부가 원산지이다. 진흙 속에서 자라면서도 청결하고 고귀한 식물로, 여러 나라 사람들에게 친근감을 주어 온 식물이다. 연못에서 자라고 논밭에서 재배하기도 한다. 뿌리줄기는 굵고 옆으로 뻗어가며 마디가 많고 가을에는 특히 끝부분이 굵어진다.\n")
